IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_aes_ss_regs.xml
<module id="AES_SS_REGS" HW_revision="" description="AES SS Registers">
	<register id="AESDMAINTEN" width="32" page="1" offset="0x0" internal="0" description="DMA Done Interrupt enable register">
		<bitfield id="DMADONECTXIN" description="Enable bit for DMADONECTXIN" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMADONEDIN" description="Enable bit for DMADONEDIN" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMADONEDOUT" description="Enable bit for DMADONEDOUT" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMADONECTXOUT" description="Enable bit for DMADONECTXOUT" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="AESDMASTATUS" width="32" page="1" offset="0x4" internal="0" description="DMA Done Interrupt status register">
		<bitfield id="DMADONECTXIN" description="Status bit for DMADONECTXIN" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="DMADONEDIN" description="Status bit for DMADONEDIN" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DMADONEDOUT" description="Status bit for DMADONEDOUT" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMADONECTXOUT" description="Status bit for DMADONECTXOUT" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="AESDMASTATUSCLR" width="32" page="1" offset="0x8" internal="0" description="DMA Done Interrupt status clear register">
		<bitfield id="DMADONECTXIN" description="Clear bit for AESDMASTSTAUS.DMADONECTXIN" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMADONEDIN" description="Clear bit for AESDMASTSTAUS.DMADONEDIN" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMADONEDOUT" description="Clear bit for AESDMASTSTAUS.DMADONEDOUT" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMADONECTXOUT" description="Clear bit for AESDMASTSTAUS.DMADONECTXOUT" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
</module>
